const beginBtn = document.querySelector('.btn-begin')
function lesson3() {
	// Створити масив з трьох чисел. Змінити значення другого елемента масиву на 10.
	// Створити масив із трьох рядків. Додати до масиву ще одну рядків.
	// Створити скрипт який поверне суму всіх чисел в масиві.
	// Створити масив з 5-ти чисел. Вивести на екран всі елементи масиву за допомогою циклу for.
	// Створити масив із 5-ти рядків. Вивести на екран кожен рядокз масиву, який містить більше 5-ти символів.
	// Створити масив з 10-ти чисел. Знайти та вивести на екран максимальне значення з масиву.
	// Створити масив з 10-ти чисел. Знайти всі парні числа в масиві та вивести їх на екран.
}

beginBtn.addEventListener('click', lesson3)
